# Core tools
brew "bat"
brew "gh"
brew "git"
brew "pyenv"
brew "pyenv-virtualenv"
brew "terraform"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "neovim"
brew "tree"
brew "coreutils"

# Terminal
cask "iterm2"
cask "font-meslo-lg-nerd-font"

# Browsers
cask "firefox"
cask "google-chrome"

# Password manager
cask "1password"
cask "1password-cli"

# Productivity
cask "alfred"
cask "visual-studio-code"

# AI
cask "claude-code"

{{ if .personal }}
# Personal only
cask "opera"
cask "brave-browser"
cask "microsoft-edge"
{{ end }}
